In [1]:
import pandas as pd

## Q1: Create a Series with indexes = 1, 2, 3 and has three names.

In [8]:
x =pd.Series(["Milak","Ibraheem","Hamdan"],index=[1,2,3])
x

1       Milak
2    Ibraheem
3      Hamdan
dtype: object

## Q2: Change indexes to 11, 12, 13.

In [11]:
x.index=[11,12,13]
x

11       Milak
12    Ibraheem
13      Hamdan
dtype: object

## Q3: Retrieve First and second elements.

In [34]:
x[:2]

11       Milak
12    Ibraheem
dtype: object

## Q4: Add duplicate elements, then remove the duplication.

In [35]:
c=pd.Series(["Ibraheem"],index=[1])

In [36]:
x.append(c)

/var/folders/q3/tx0_1xx91dzcrhv5n3l03fwh0000gn/T/ipykernel_36082/1476673440.py:1: FutureWarning: The series.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  x.append(c)

11       Milak
12    Ibraheem
13      Hamdan
1     Ibraheem
dtype: object

In [37]:
x.drop_duplicates()

11       Milak
12    Ibraheem
13      Hamdan
dtype: object

## Q5: Create a Students DataFrame has three columns (ID, Name, GPA).

In [24]:
Students = pd.DataFrame([{"ID":1,"Name":"Milak","GPA":3}])
Students

   ID   Name  GPA
0   1  Milak    3

## Q6: Read educ_figdp_1_Data.csv file and print the head.

In [26]:
df =pd.read_csv("educ_figdp_1_Data.csv")
df

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e
...,...,...,...,...,...
379,2007,Finland,Total public expenditure on education as % of ...,5.90,NaN
380,2008,Finland,Total public expenditure on education as % of ...,6.10,NaN
381,2009,Finland,Total public expenditure on education as % of ...,6.81,NaN
382,2010,Finland,Total public expenditure on education as % of ...,6.85,NaN
383,2011,Finland,Total public expenditure on education as % of ...,6.76,NaN

## Q7: Give an example shows the difference between loc and slicing?
**Note:**
- loc use the index labels as references.
- slice use the position as references.

In [27]:
df.loc[:4]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e
4,2004,European Union (28 countries),Total public expenditure on education as % of ...,4.95,e

In [28]:
df[:4]

,TIME,GEO,INDIC_ED,Value,Flag and Footnotes
0,2000,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
1,2001,European Union (28 countries),Total public expenditure on education as % of ...,:,NaN
2,2002,European Union (28 countries),Total public expenditure on education as % of ...,5.00,e
3,2003,European Union (28 countries),Total public expenditure on education as % of ...,5.03,e